{
    "title": "HI, I'M A FREELANCER",
    "buttonTranslate": "Translate",
    "navbarFirstLink": "Home",
    "navbarSecundLink": "ABOUT",
    "navbarThirdLink": "SERVICES",
    "navbarFourthLink": "RESUME",
    "navbarFivethLink": "PORTFOLIO",
    "navbarSixthLink": "REFERENCES",
    "navbarSeventhLink": "CONTACT",

    "headerInfo": "Operating out of São José dos Campos, SP, BR",
    "headerLink": "View My Works",

    "aboutTitle": "About Me",
    "about-subTitle": "Know Me More",
    "main-text": "Hi, I'm",
    "about-text-firstLine": "I currently work as a systems information programmer and have skills in web development, creating landing pages, web pages, and websites, consuming APIs, and generating all kinds of reports for educational systems.",
    "about-text-secundLine": "I have skills in HTML, CSS, JavaScript, React.js, as well as tools like Visual Studio Code, Grape.js, Github, among others. I have basic knowledge in technologies such as TypeScript, MySQL, MongoDB, package management with NPM, Python, PHP, Cloud Computing AWS, NGINX, PM2, and others for backend usage. I have previous experience as an intern at the Court of Auditors (TCU), where I helped develop and maintain Oracle Express web applications with the Apex framework.",
    "about-text-thirdLine": "Certifications in Web Development with PHP, WordPress, Bootstrap 5, JavaScript, HTML5, and CSS3, Essential Programming Logic, Advanced Systems Architecture.",
    "about-text-fourthLine": "I am always seeking opportunities to enhance my skills and expand my experience in web development and/or front-end. I am open to new challenges and opportunities.",
    "about-text-fivethLine": "I have over 20 years of work experience, having worked in other areas such as retail and transportation.",
    "years-of": "Years of",
    "experiance": "Experiance",
    "name": "Name",
    "email": "Email",
    "date birth text":"Date of birth",
    "date birth": "07 May, 1984",
    "from": "From",

    "servicesTitle":"What I do?",
    "servicesSubTitle":"How I can help your next project",
    "servicesCardOne-title":"Web developer",
    "servicesCardOne-text":"I create the visual and interactive interface of websites/web applications. I use HTML, CSS and JavaScript for visuals, styles and interactivity, aiming for an attractive, intuitive and responsive experience",
    "servicesCardTwo-title":"UI/UX Developer",
    "servicesCardTwo-text":"Implement designs with working code using HTML, CSS and JavaScript. Create interactive elements for an intuitive user experience. I collaborate with designers for design fidelity and interface optimization.",
    "servicesCardThree-title":"Responsive",
    "servicesCardThree-text":"My goal is to provide a consistent and user-friendly experience across all devices. This includes analyzing the requirements, creating responsive layouts, coding in HTML and CSS, testing on various devices, and optimizing performance. I constantly strive to enhance the project's quality.",
    "servicesCardFour-title":"Navigability",
    "servicesCardFour-text":"Create an intuitive, easy-to-use navigation for users, allowing them to easily find the content they want.",
    "servicesCardFive-title":"Performance Optimization",
    "servicesCardFive-text":"Implement practices and techniques to improve website performance, such as fast loading, file size reduction, and image optimization.",
    "servicesCardSix-title":"Accessibility",
    "servicesCardSix-text":"Ensure website accessibility for all users, including those with disabilities. Follow guidelines for image descriptions, keyboard navigation, and contrast to promote inclusivity.",

    "resume": "Resume",
    "resume-summary": "A summary of My Resume",
    "resumo-education-title": "My Education",

    "education-one": "Systems analysis and development, Information Technology",
    "education-instituition-one": "Anhanguera University | 07/2020 - 08/2022",
    "education-description-one": "Algorithms and Structured Programming | Systems Analysis and Modeling | Computer Architecture and Organization | Mobile Development | Digital Culture | Design Thinking | Digital Marketing | Agile Mindset | Software Engineering | Object-Oriented Programming Languages | Computational Logic | Data Modeling | Programming and Database Development | Web Programming | Systems Security and Auditing | Operating Systems | Brazilian Society and Citizenship.",
    "education-two": "Web Programming Language (PHP)",
    "education-instituition-two": "DRM Education | 10/2022 - 11/2022",
    "education-description-two": "Understand the environment and basic structure of the PHP language. | Basic syntax of PHP. | Data types in PHP. | Operators in PHP.",
    "education-three": "Web Design in WordPress",
    "education-instituition-three": "DRM Education | 09/2022 - 10/2022",
    "education-description-three": "The Web and its Services | WordPress | Exporting a Theme | Adding Services to the Website.",
    "education-four": "JavaScript",
    "education-instituition-four": "Udemy | 06/2021 - 07/2021",
    "education-description-four": "Introduction to Javascript, What is Javascript, Basic syntax, Variables and Data Types, Operators and Expressions, Control Structures (Conditions, Loops, Switch-case), Functions (Declaration, Parameters, Return), Arrays (Creation, Manipulation, Accessing elements), Objects (Creation, Properties, Methods), DOM Manipulation (Interacting with HTML elements, Selection, Content manipulation), Exception Handling (try-catch blocks, Throwing, Error handling), AJAX and Asynchronous Requests (Introduction to AJAX, HTTP requests, Response handling), Introduction to ES6 (Let and const, Arrow functions, Template literals), Introduction to Node.js (Installation and configuration, Modules and require, File manipulation), Introduction to frameworks and libraries (Examples of popular frameworks, Introduction to jQuery, Usage of external libraries), Development Best Practices (Code organization, Comments, Debugging)",
    "resumo-experience-title": "My Experience",
    "experience-one": "Information systems programmer",
    "experience-instituition-one": "DRM Education | 05/2022 - Present",
    "experience-description-one": "Development of responsive websites, landing pages, and pages that adapt to different screen sizes using HTML, CSS, JavaScript, and Visual Studio Code, Instruction to clients in the use of the Grape.js framework for page development and maintenance, Collaboration with the team to prioritize tasks and meet established deadlines, Creation of reports for educational institutions, Creation of animations and interactions using JavaScript, Retrieval of data from APIs and REST APIs, Dynamic creation of components and elements based on information obtained from APIs, Form validation using JavaScript.",
    "experience-two": "Intern",
    "experience-instituition-two": "Federal Court of Accounts | 09/2021 - 11/2021 ",
    "experience-description-two": "Collaborating in the development of web applications using the Oracle Express tool with direct integration of the tool with the PL/SQL database, performed maintenance and/or created new functionalities on the internal website of the TCU educational institution, added enhancements to projects using HTML, CSS, and JavaScript when necessary.",
    "experience-three": "Store Manager",
    "experience-instituition-three": "Terra e Sol Eireli Market | 05/2019 - 12/2020",
    "experience-description-three": "Acting as a leader in all sectors of the store (butchery, bakery, cashiers, etc.), Implementation of process standardization (POP), Creating promotions to build customer loyalty, Providing customer service by identifying their needs, Planning to increase the average ticket, Preserving ethics in commercial relations with suppliers and partners through transparency in information and honest attitudes, Interfacing with other areas of the company to establish action plans in order to meet customer needs and define strategies to align commercial demands, Monitoring the evolution of monthly, quarterly, and semi-annual billing and developing ways to keep it growing, Conducting meetings to present monthly results, Implementing checklists, targets, and result tracking.",
    "skillTitle":"My Skills",
    "skillName-one":"Web Development",
    "downloadEnResume":"Download CV (EN)",
    "downloadPtResume":"Download CV (PT)",
    "linkEnResume": "See before downloading CV (EN)",
    "linkPtResume": "See before downloading CV (PT)",

    "portfolio": "Portfolio",
    "portfolio-summary": "Some of my most recent projects",
    "portfolio-title-0": "My Portfolio",
    "description-project-0": "This project reflects my practical experience in design implementation and interactive interactions. I highlight my creativity through web pages with a unique style, ensuring a captivating user experience. This portfolio demonstrates versatility with diverse projects, including websites and web applications. I am eager to share my work and demonstrate how I can contribute to the success of your project! Frameworks used: Vite.js and React.js. Libraries used: React-Router-Dom, React-scroll, Styled-Components, flag-icon-css, react-i18next.",
    "portfolio-title-1": "API Rest",
    "description-project-1":"This REST API was developed using a combination of cutting-edge technologies and tools, such as Docker, Nginx, and PM2. React.js served as the foundation for development, providing a robust and flexible API. GitHub was used for efficient source code control, ensuring integrity. Hosting was done on AWS, ensuring scalability and reliability. This combination enabled the creation of a highly performant, scalable, and reliable REST API to meet the application's needs.",
    "portfolio-title-2": "Consume API Rest",
    "description-project-2":"This application was developed using React.js to consume a Rest API that I created. It simulates a simple registration of users/employees in an educational institution, allowing the registration of students as well, including a photo and other information. The main focus of this implementation was on the creation and consumption of the Rest API, using technologies such as Nginx and PM2. Additionally, the following technologies were used: React.js, Javascript, CSS, HTML. For the construction of the application, the following libraries were used: Styled-Components, react-icons, history, axios, redux, lodash, validator, express-delay. Some of the tools used in development include: npm, Nginx, PM2.",
    "portfolio-title-3": "GolPag page",
    "description-project-3":"I developed a functional and responsive landing page as part of my work as a front-end developer. I utilized modern technologies such as HTML5, CSS3, and JavaScript, implementing responsive design to adapt the page to different devices. I used Bootstrap to optimize development, providing flexible layouts and an interactive experience. The landing page highlights the transparent and powerful features of GOLPAG, with clear information and engaging design. I followed organized coding practices, ensuring code maintainability. I am proud of this work, utilizing front-end skills including HTML, CSS, and JavaScript to create functional and appealing interfaces.",
    "portfolio-title-4": "Classic - Template ",
    "description-project-4":"I developed unique website templates for company clients using HTML, CSS, JavaScript, and Grape.js. The templates consume a custom API, bringing specific information for each client. With Grape.js, it is easy to add or remove sections as needed. This experience strengthened my front-end skills and enhanced my proficiency in Grape.js, enabling me to create customized and efficient solutions to meet client needs.",
    "portfolio-title-5": " Ocean - Template",
    "description-project-5":"I developed unique website templates for company clients using HTML, CSS, JavaScript, and Grape.js. The templates consume a custom API, bringing specific information for each client. With Grape.js, it is easy to add or remove sections as needed. This experience strengthened my front-end skills and enhanced my proficiency in Grape.js, enabling me to create customized and efficient solutions to meet client needs.",
    "project_link": "Project Link",
    "github_link": "GitHub Link",

    "interested_title": "Interested in working with me?",
    "interested_link": "Hire me!",

    "recommendations": "References",
    "recomendations_title": "Some References",
    "recom_source": "Source: LinkedIn",
    "first_recom_name": "Abraão Vasconcelos",
    "first_recom_position": ".NET Back End Developer",
    "first_recom_decription": "Isaias comes highly recommended as a talented front-end developer. He stands out for his technical skills and dedication to the field. His proficiency in HTML, CSS, and JavaScript is impressive, and he keeps up with the latest trends and best practices. Transforming designs into engaging interfaces is one of its notable skills. In addition, Isaias is a collaborative and communicative teammate, always willing to help and contribute to the success of the projects in which he is involved.",
    "first_recom_photo": "https:\/\/bit.ly\/3WPDwDM",
    "secund_recom_name": "Fábio Francisco de Paula",
    "secund_recom_position": "Logistics Manager / Distribution Manager",
    "secund_recom_decription": "I recommend Isaías, because we work in a multinational and Isaías was an above average professional, always looking for knowledge and problem solving, really a person determined to contribute to the growth of the Company and people, so the Company that hires him will be hiring a person who will make a difference and will always be ready to add to the team working with great security and love for what he does.",
    "secund_recom_photo": "https:\/\/bit.ly\/3OVg6uU",
    "third_recom_name": "Leila Santana",
    "third_recom_position": "Nail Design | toll operator",
    "third_recom_decription": "Isaias is dedicated and resilient and does not allow himself to be overcome by adversity. Isaias has always treated customers with simplicity and empathy. Additionally, he has qualities as a person, fundamental in any organization.",
    "third_recom_photo": "https:\/\/bit.ly\/3CbuebS",
    "fourth_recom_name": "Kim Frana",
    "fourth_recom_position": "Full ReactJS Front-end Web Developer",
    "fourth_recom_decription": "I had the pleasure of accompanying Isaias in his career. He undoubtedly has a lot to add to any development team. As some characteristics of this professional, his team communication skills, responsibility in his deliveries, his constant search to improve his hard skills, proactivity in the deliveries of his demands, among others. In addition to his hard skills, he is a distinguished professional in Soft skills, which makes him work very well integrated into any team.",
    "fourth_recom_photo": "https:\/\/bit.ly\/3Nn7kVi",

    "contact_text_title": "Let's get in touch",
    "contact_text_text": "I enjoy discussing new projects and design challenges. Please share as much info, as possible so we can get the most out of our first contact.",
    "contact_text_subtitle": "Living In:",
    "contact_text_address": "Hamailton de Freitas Street, 1107, Sao Jose dos Campos, BR.",
    "contact_text_call": "Call",
    "contact_form_error_name": "Please fill in your name.",
    "contact_form_error_email": "Please fill in your email.",
    "contact_form_error_message": "Please fill in the message.",
    "contact_form_title": "Estimate your Project?",
    "contact_form_label_name": "What is Your Name:",
    "contact_form_label_email": "Your Email Address:",
    "contact_form_label_message": "How can I Help you?:",
    "contact_form_button": "Send",

    "success_itle": "Message sent successfully!",
    "success_text": "Thank you for getting in touch, you will receive a response shortly. Visit our networks through the icons, it will be a pleasure to receive your visit.",
    "not_support_video": "Your browser does not support HTML 5 video.",

    "copyright": "Copyright",
    "all_rights_reserved": "All Rights Reserved."
}