{
  "title": "OLÁ, SOU FREELANCER",
  "buttonTranslate": "Traduzir",
  "navbarFirstLink": "INÍCIO",
  "navbarSecundLink": "SOBRE",
  "navbarThirdLink": "SERVIÇOS",
  "navbarFourthLink": "CURRÍCULO",
  "navbarFivethLink": "PORTFÓLIO",
  "navbarSixthLink": "REFERÊNCIAS",
  "navbarSeventhLink": "CONTATO",

  "headerInfo": "Operando em São José dos Campos, SP, BR",
  "headerLink": "Ver Meus trabalhos",

  "aboutTitle": "Sobre mim",
    "about-subTitle": "Conheça me mais",
    "main-text": "Olá, sou",
    "about-text-firstLine": "Atualmente trabalho como programador de sistemas de informação e possuo habilidades em desenvolvimento web, criando landing pages, páginas e websites, consumindo APIs e criando todo tipo de relatórios para sistemas educacionais.",
    "about-text-secundLine": "Tenho habilidades em HTML, CSS, JavaScript, React.js, além de ferramentas como Visual Studio Code, Grape.js, Github, entre outras. Possuo conhecimento básico em tecnologias como TypeScript, MySQL, MongoDB, gerenciamento de pacotes NPM, Python, PHP, Cloud Computing AWS, NGINX, PM2 e outras para uso no backend. Tenho experiência anterior como estagiário no Tribunal de Contas da União (TCU), onde ajudei a desenvolver e manter aplicações web Oracle Express com o framework Apex.",
    "about-text-thirdLine": "Certificados em Desenvolvimento Web em PHP, WordPress Bootstrap 5, JavaScript, HTML5 e CSS3, Lógica de Programação Essencial, Arquitetura de Sistemas Avançados.",
    "about-text-fourthLine": "Estou sempre em busca de oportunidades para aprimorar minhas habilidades e ampliar minha experiência na área de desenvolvimento web e/ou front-end, e estou aberto a novos desafios e oportunidades.",
    "about-text-fivethLine": "Tenho mais de 20 anos de experiência no mercado de trabalho, tendo passado por outras áreas como varejo e transporte.",
    "years-of": "Anos de",
    "experiance": "Experiência",
    "name": "Nome",
    "email": "E-mail",
    "date birth text":"Data de nasc.",
    "date birth": "07 de maio, 1984",
    "from": "De",

    "servicesTitle":"O que eu faço?",
    "servicesSubTitle":"Como posso ajudar seu próximo projeto",
    "servicesCardOne-title":"Desenvolvedor web",
    "servicesCardOne-text":"Criar a interface visual e interativa de sites/aplicativos web. Utilizo HTML, CSS e JavaScript para visuais, estilos e interatividade, visando uma experiência atrativa, intuitiva e responsiva",
    "servicesCardTwo-title":"Desenvolvedor de UI/UX",
    "servicesCardTwo-text":"Implementar designs com código funcional usando HTML, CSS e JavaScript. Crie elementos interativos para uma experiência de usuário intuitiva. Colaboro com designers para fidelidade de design e otimização de interface.",
    "servicesCardThree-title":"Responsivo",
    "servicesCardThree-text":"Meu objetivo é proporcionar uma experiência consistente e amigável em todos os dispositivos. Isso inclui analisar as necessidades, criar layouts adaptáveis, codificar em HTML e CSS, testar em diversos dispositivos e otimizar o desempenho. Busco sempre aprimorar a qualidade do projeto.",
    "servicesCardFour-title":"Navegabilidade",
    "servicesCardFour-text":"Criar uma navegação intuitiva e fácil de usar para os usuários, permitindo que eles encontrem facilmente o conteúdo que desejam.",
    "servicesCardFive-title":"Otimização de performance",
    "servicesCardFive-text":"Implementar práticas e técnicas para melhorar o desempenho do site, como carregamento rápido, redução de tamanho de arquivo e otimização de imagem.",
    "servicesCardSix-title":"Acessibilidade",
    "servicesCardSix-text":"Garantir a acessibilidade do site para todos os usuários, incluindo aqueles com deficiência. Sigo as diretrizes para descrições de imagens, navegação pelo teclado e contraste para promover a inclusão.",

    "resume": "Currículo",
    "resume-summary": "Um resumo do meu currículo",
    "resumo-education-title": "Minha Educação",

    "education-one": "Análise e desenvolvimento de sistemas, Tecnologia da Informação",
    "education-instituition-one": "Universidade Anhanguera | 07/2020 - 08/2022",
    "education-description-one": "Algoritmos e Programação Estruturada | Análise e Modelagem de Sistemas | Arquitetura e Organização de Computadores | Desenvolvimento móvel | Cultura Digital | Pensamento de Design | Marketing Digital | Mentalidade Ágil | Engenharia de Software | Linguagens de Programação Orientadas a Objetos | Lógica Computacional | Modelagem de Dados | Programação e Desenvolvimento de Banco de Dados | Programação Web | Segurança e Auditoria de Sistemas | Sistemas operacionais | Sociedade Brasileira e Cidadania.",
    "education-two": "Linguagem de Programação Web (PHP)",
    "education-instituition-two": "DRM Educação | 10/2022 - 11/2022",
    "education-description-two": "Entenda o ambiente e a estrutura básica da linguagem PHP. | Sintaxe básica do PHP. | Tipos de dados em PHP. | Operadores em PHP.",
    "education-three": "Webdesign em WordPress",
    "education-instituition-three": "DRM Educação | 09/2022 - 10/2022",
    "education-description-three": "A Web e seus Serviços | WordPress | Exportando um Tema | Adicionando serviços ao site.",
    "education-four": "JavaScript",
    "education-instituition-four": "Udemy | 06/2021 - 07/2021",
    "education-description-four": "IIntrodução ao Javascript, O que é Javascript, Sintaxe básica, Variáveis e Tipos de Dados, Operadores e Expressões, Estruturas de Controle (Condições, Loops, Switch-case), Funções (Declaração, Parâmetros, Retorno), Arrays (Criação, Manipulação, Acesso a elementos), Objetos (Criação, Propriedades, Métodos), Manipulação do DOM (Interagindo com elementos HTML, Seleção, Manipulação de conteúdo), Tratamento de Exceções (Blocos try-catch, Lançamento, Manipulação de erros), AJAX e Requisições Assíncronas (Introdução ao AJAX, Requisições HTTP, Manipulação de respostas), Introdução ao ES6 (Let e const, Arrow functions, Template literals), Introdução ao Node.js (Instalação e configuração, Módulos e require, Manipulação de arquivos), Introdução a frameworks e bibliotecas (Exemplos de frameworks populares, Introdução ao jQuery, Uso de bibliotecas externas), Boas práticas de desenvolvimento (Organização de código, Comentários, Debugging).",
    "resumo-experience-title": "Minha Experiência",
    "experience-one": "Programador de sistemas de informação",
    "experience-instituition-one": "DRM Educação | 05/2022 - Presente",
    "experience-description-one": "Desenvolvimento de sites responsivos, landing pages e páginas que se ajustam a diferentes tamanhos de tela, utilizando HTML, CSS, JavaScript e Visual Studio Code, Instrução para clientes na utilização do framework Grape.js para desenvolvimento e manutenção de páginas, Colaboração com a equipe para priorizar tarefas e entregar no prazo estabelecido, Criação de relatórios para instituições de ensino, Criação de animações e interações usando JavaScript, Recuperação de dados de APIs e APIs REST, Criação dinâmica de componentes e elementos com base em informações obtidas de APIs, Validação de formulário usando JavaScript.",
    "experience-two": "Estagiário",
    "experience-instituition-two": "Tribunal de Contas da União | 09/2021 - 11/2021",
    "experience-description-two": "Colaborar no desenvolvimento de aplicações web utilizando a ferramenta Oracle Express com integração direta da ferramenta com o banco de dados PL/SQL, Realizou a manutenção e/ou criação de novas funcionalidades no site interno da instituição de ensino do TCU, Adicionado aprimoramentos para projetos usando HTML, CSS e JavaScript quando necessário.",
    "experience-three": "Gerente de loja",
    "experience-instituition-three": "Mercado Terra e Sol Eireli | 05/2019 - 12/2020",
    "experience-description-three": "Atuar como líder em todos os setores da loja (açougue, padaria, caixas, etc.), Implantação de padronização de processos (POP), Criação de promoções para fidelização de clientes, Atender ao cliente identificando suas necessidades, Planejamento para aumento do ticket médio, Preservar a ética nas relações comerciais com fornecedores e parceiros, por meio da transparência nas informações e atitudes honestas, Interface com as demais áreas da empresa para estabelecer planos de ação a fim de atender as necessidades dos clientes e definir estratégias para alinhar as demandas comerciais, Acompanhar a evolução do faturamento mensal, trimestral e semestral e desenvolver formas de mantê-lo em crescimento, Realização de reuniões para apresentação de resultados mensais, Implementação de checklists, metas e acompanhamento de resultados.",
    "skillTitle":"Minhas Habilidades",
    "skillName-one":"Desenvolvimento web",
    "downloadEnResume":"Baixar CV (EN)",
    "downloadPtResume":"Baixar CV (PT)",
    "linkEnResume": "Veja antes de baixar CV (EN)",
    "linkPtResume": "Veja antes de baixar CV (PT)",

    "portfolio": "Portfólio",
    "portfolio-summary": "Alguns dos meus projetos mais recentes",
    "portfolio-title-0": "Meu portfólio",
    "description-project-0": "Este projeto reflete minha experiência prática em implementação de design e interações interativas. Destaco minha criatividade através de páginas web com um estilo único, garantindo uma experiência cativante ao usuário. Este portfólio demonstra versatilidade com diversos projetos, incluindo websites e aplicações web. Estou ansioso para compartilhar meu trabalho e demonstrar como posso contribuir para o sucesso do seu projeto! Frameworks utilizados: Vite.js e React.js. Bibliotecas usadas: React-Router-Dom, React-scroll, Styled-Components, flag-icon-css, react-i18next.",
    "portfolio-title-1": "API Rest",
    "description-project-1":"Essa API REST foi desenvolvida usando uma combinação de tecnologias e ferramentas de ponta, como Docker, Nginx e PM2. O React.js serviu como base para o desenvolvimento, fornecendo uma API robusta e flexível. O GitHub foi usado para controle eficiente do código-fonte, garantindo a integridade. A hospedagem foi feita na AWS, garantindo escalabilidade e confiabilidade. Essa combinação permitiu a criação de uma API REST de alto desempenho, escalonável e confiável para atender às necessidades do aplicativo.",
    "portfolio-title-2": "Consumir API Rest",
    "description-project-2":"Este aplicativo foi desenvolvido usando React.js para consumir uma API Rest que criei. Simula um simples cadastro de usuários/funcionários em uma instituição de ensino, permitindo também o cadastro de alunos, incluindo foto e outras informações. O foco principal desta implementação foi a criação e consumo da API Rest, utilizando tecnologias como Nginx e PM2. Adicionalmente, foram utilizadas as seguintes tecnologias: React.js, Javascript, CSS, HTML. Para a construção da aplicação foram utilizadas as seguintes bibliotecas: Styled-Components, react-icons, history, axios, redux, lodash, validator, express-delay. Algumas das ferramentas usadas no desenvolvimento incluem: npm, Nginx, PM2.",
    "portfolio-title-3": "Página GolPag",
    "description-project-3":"Desenvolvi uma landing page funcional e responsiva como parte do meu trabalho como desenvolvedor front-end. Utilizei tecnologias modernas como HTML5, CSS3 e JavaScript, implementando design responsivo para adaptar a página a diferentes dispositivos. Usei o Bootstrap para otimizar o desenvolvimento, fornecendo layouts flexíveis e uma experiência interativa. A página de destino destaca os recursos transparentes e poderosos do GOLPAG, com informações claras e design envolvente. Segui práticas de codificação organizadas, garantindo a manutenção do código. Tenho orgulho deste trabalho, utilizando habilidades front-end, incluindo HTML, CSS e JavaScript para criar interfaces funcionais e atraentes.",
    "portfolio-title-4": "Clássico - Modelo",
    "description-project-4":"Desenvolvi modelos de sites exclusivos para clientes da empresa usando HTML, CSS, JavaScript e Grape.js. Os templates consomem uma API customizada, trazendo informações específicas para cada cliente. Com o Grape.js, é fácil adicionar ou remover seções conforme necessário. Essa experiência fortaleceu minhas habilidades de front-end e aprimorou minha proficiência em Grape.js, permitindo-me criar soluções personalizadas e eficientes para atender às necessidades do cliente.",
    "portfolio-title-5": "Oceano - Modelo",
    "description-project-5":"Desenvolvi modelos de sites exclusivos para clientes da empresa usando HTML, CSS, JavaScript e Grape.js. Os templates consomem uma API customizada, trazendo informações específicas para cada cliente. Com o Grape.js, é fácil adicionar ou remover seções conforme necessário. Essa experiência fortaleceu minhas habilidades de front-end e aprimorou minha proficiência em Grape.js, permitindo-me criar soluções personalizadas e eficientes para atender às necessidades do cliente.",
    "project_link": "Link do Projeto",
    "github_link": "Link do GitHub",

    "interested_title": "Interessado em trabalhar comigo?",
    "interested_link": "Contrate me!",
    
    "recommendations": "Referências",
    "recomendations_title": "Algumas referências",
    "recom_source": "Fonte: LinkedIn",
    "first_recom_name": "Abraão Vasconcelos",
    "first_recom_position": "Desenvolvedor Back-end .NET",
    "first_recom_decription": "Isaias é altamente recomendado como um talentoso desenvolvedor front-end. Ele se destaca por sua capacidade técnica e dedicação ao campo. Sua proficiência em HTML, CSS e JavaScript é impressionante e ele acompanha as últimas tendências e práticas recomendadas. Transformar designs em interfaces envolventes é uma de suas habilidades notáveis. Além disso, Isaias é um companheiro de equipe colaborativo e comunicativo, sempre disposto a ajudar e contribuir para o sucesso dos projetos em que está envolvido.",
    "first_recom_photo": "https:\/\/bit.ly\/3WPDwDM",
    "secund_recom_name": "Fábio Francisco de Paula",
    "secund_recom_position": "Gerente de Logística / Gerente de Distribuição",
    "secund_recom_decription": "Recomendo o Isaías, pois trabalhamos em uma multinacional e o Isaías foi um profissional acima da média, sempre em busca de conhecimento e resolução de problemas, realmente uma pessoa determinada a contribuir com o crescimento da Empresa e das pessoas, por isso a Empresa que o contratar estará contratando uma pessoa que fará a diferença e estará sempre pronta para somar na equipe trabalhando com muita segurança e amor pelo que faz.",
    "secund_recom_photo": "https:\/\/bit.ly\/3OVg6uU",
    "third_recom_name": "Leila Santana",
    "third_recom_position": "Design de unhas| Operadora de pedágio",
    "third_recom_decription": "Isaias é dedicado e resiliente e não se deixa vencer pelas adversidades. Isaias sempre tratou os clientes com simplicidade e empatia. Além disso, possui qualidades como pessoa, fundamentais em qualquer organização.",
    "third_recom_photo": "https:\/\/bit.ly\/3CbuebS",
    "fourth_recom_name": "Kim Frana",
    "fourth_recom_position": "Desenvolvedor Web Front-end ReactJS Pleno",
    "fourth_recom_decription": "Tive o prazer de poder acompanhar Isaías em sua carreira. Ele sem sombra de dúvidas tem muito a somar em qualquer time de desenvolvimento. Como algumas características desse profissional, se destacam suas habilidades de comunicação em equipe, a responsabilidade nas suas entregas, sua busca constante em se aprimorar em suas hard skills, a proatividade nas entregas das suas demandas, entre outras. Além das suas hard skills é um profissional diferenciado nas Soft skills, o que faz com que trabalhe muito bem integrado a qualquer time.",
    "fourth_recom_photo": "https:\/\/bit.ly\/3Nn7kVi",

    "contact_text_title": "Vamos entrar em contato",
    "contact_text_text": "Gosto de discutir novos projetos e desafios de design. Por favor, compartilhe o máximo de informações possível para que possamos tirar o máximo proveito de nosso primeiro contato.",
    "contact_text_subtitle": "Vivendo em:",
    "contact_text_address": "Rua Hamailton de Freitas, 1107, São José dos Campos, BR.",
    "contact_text_call": "Chamar",
    "contact_form_error_name": "Por favor, preencha seu nome.",
    "contact_form_error_email": "Por favor, preencha seu e-mail.",
    "contact_form_error_message": "Por favor, preencha a mensagem.",
    "contact_form_title": "Estimar seu projeto?",
    "contact_form_label_name": "Qual o seu nome:",
    "contact_form_label_email": "Seu endereço de email:",
    "contact_form_label_message": "Como posso ajudá-lo?:",
    "contact_form_button": "Enviar",

    "success_itle": "Mensagem enviada com sucesso!",
    "success_text": "Obrigado por entrar em contato, em breve você receberá um retorno. Visite nossas redes através dos ícones, será um prazer receber sua visita.",
    "not_support_video": "Seu navegador não suporta vídeo HTML 5.",

    "copyright": "Direitos autorais",
    "all_rights_reserved": "Todos os direitos reservados."
}
  